#!/usr/bin/env bash

_goto_help() {
    echo "Використання: goto [опції] [аргументи]"
    echo
    echo "  goto <назва>                                                - Перехід до проєкту"
    echo "  goto [ -l | --list ]                                        - Список усіх проєктів"
    echo "  goto { -a | --add } <назва> [шлях]                          - Зберегти поточну (або вказану) папку"
    echo "  goto { -m | --modify } <назва> { нова назва | новий шлях }  - Змінити назву або шлях для проєкту"
    echo "  goto { -r | --remove } <назва>                              - Видалити проєкт зі списку"
    echo "  goto { -h | --help }                                        - Вивести цю довідку"
}